tutorials/lagrangian/reactingParcelFilmFoam/splashPanel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    sides
    {
        type            patch;
        nFaces          1400;
        startFace       11200;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            directMappedWall;
        nFaces          200;
        startFace       12600;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets
200
(
(4.33680869e-19 4.33680869e-19 -0)
(-8.67361738e-19 -8.67361738e-19 -0)
(-4.33680869e-19 -0 -0)
(-0 3.469446952e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(4.33680869e-19 -0 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(8.67361738e-19 4.33680869e-19 -0)
(-8.67361738e-19 -8.67361738e-19 -0)
(-0 1.734723476e-18 -0)
(-0 3.469446952e-18 -0)
(-0 -3.469446952e-18 -0)
(8.67361738e-19 1.387778781e-17 -0)
(-8.67361738e-19 -0 -0)
(-8.67361738e-19 -6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-8.67361738e-19 -0 -0)
(-0 -4.33680869e-19 -0)
(-1.734723476e-18 -1.734723476e-18 -0)
(-1.734723476e-18 1.734723476e-18 -0)
(-3.469446952e-18 -0 -0)
(-3.469446952e-18 -0 -0)
(-1.734723476e-18 3.469446952e-18 -0)
(-0 -0 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -0 -0)
(-0 -0 -0)
(-3.469446952e-18 -8.67361738e-19 -0)
(-3.469446952e-18 -1.734723476e-18 -0)
(-0 3.469446952e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 3.469446952e-18 -0)
(3.469446952e-18 -0 -0)
(3.469446952e-18 6.938893904e-18 -0)
(3.469446952e-18 -6.938893904e-18 -0)
(3.469446952e-18 6.938893904e-18 -0)
(-3.469446952e-18 -8.67361738e-19 -0)
(-3.469446952e-18 -1.734723476e-18 -0)
(-3.469446952e-18 3.469446952e-18 -0)
(-3.469446952e-18 -0 -0)
(-3.469446952e-18 -0 -0)
(-3.469446952e-18 3.469446952e-18 -0)
(-0 -0 -0)
(-3.469446952e-18 6.938893904e-18 -0)
(-3.469446952e-18 -6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-6.938893904e-18 -0 -0)
(3.469446952e-18 -0 -0)
(3.469446952e-18 -0 -0)
(-3.469446952e-18 -3.469446952e-18 -0)
(-0 -6.938893904e-18 -0)
(-1.040834086e-17 -0 -0)
(-1.040834086e-17 -6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(-6.938893904e-18 -1.734723476e-18 -0)
(-0 -0 -0)
(-6.938893904e-18 -3.469446952e-18 -0)
(-6.938893904e-18 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -4.33680869e-19 -0)
(6.938893904e-18 -0 -0)
(-0 -1.734723476e-18 -0)
(6.938893904e-18 -3.469446952e-18 -0)
(6.938893904e-18 6.938893904e-18 -0)
(-6.938893904e-18 6.938893904e-18 -0)
(-6.938893904e-18 -0 -0)
(-6.938893904e-18 -0 -0)
(-6.938893904e-18 -6.938893904e-18 -0)
(-6.938893904e-18 -0 -0)
(-6.938893904e-18 -0 -0)
(6.938893904e-18 -0 -0)
(-6.938893904e-18 -1.734723476e-18 -0)
(-6.938893904e-18 -3.469446952e-18 -0)
(-6.938893904e-18 6.938893904e-18 -0)
(-6.938893904e-18 6.938893904e-18 -0)
(-6.938893904e-18 6.938893904e-18 -0)
(-6.938893904e-18 -6.938893904e-18 -0)
(-6.938893904e-18 -6.938893904e-18 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -1.734723476e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -0 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(6.938893904e-18 -0 -0)
(6.938893904e-18 -1.734723476e-18 -0)
(-0 -3.469446952e-18 -0)
(-0 6.938893904e-18 -0)
(1.387778781e-17 6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(1.387778781e-17 -0 -0)
(6.938893904e-18 -8.67361738e-19 -0)
(-0 -1.734723476e-18 -0)
(1.387778781e-17 -0 -0)
(6.938893904e-18 -0 -0)
(6.938893904e-18 -3.469446952e-18 -0)
(-0 6.938893904e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-6.938893904e-18 -0 -0)
(-2.081668171e-17 -1.734723476e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -0 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-2.775557562e-17 -0 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 -8.67361738e-19 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-0 -0 -0)
(-0 -3.469446952e-18 -0)
(-1.387778781e-17 -1.387778781e-17 -0)
(-0 6.938893904e-18 -0)
(-0 1.387778781e-17 -0)
(-1.387778781e-17 -1.387778781e-17 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(1.387778781e-17 -0 -0)
(-0 -3.469446952e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-2.775557562e-17 -0 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(1.387778781e-17 -0 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(1.387778781e-17 -0 -0)
(-4.163336342e-17 -3.469446952e-18 -0)
(-4.163336342e-17 -6.938893904e-18 -0)
(-2.775557562e-17 -0 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 -8.67361738e-19 -0)
(1.387778781e-17 -1.734723476e-18 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-0 -3.469446952e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 -1.387778781e-17 -0)
(1.387778781e-17 6.938893904e-18 -0)
(1.387778781e-17 6.938893904e-18 -0)
(-1.387778781e-17 -1.387778781e-17 -0)
(-0 -0 -0)
(-0 -1.734723476e-18 -0)
(-0 -0 -0)
(-4.163336342e-17 -3.469446952e-18 -0)
(-4.163336342e-17 -6.938893904e-18 -0)
(-2.775557562e-17 -0 -0)
(1.387778781e-17 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -0 -0)
(1.387778781e-17 -0 -0)
(-2.775557562e-17 -0 -0)
(-2.775557562e-17 -1.734723476e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -0 -0)
(1.387778781e-17 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(1.387778781e-17 -0 -0)
)
;
    }
)

// ************************************************************************* //
